---
kind: method
id: M:Autodesk.Revit.DB.CopyPasteOptions.GetDuplicateTypeNamesHandler
source: html/f50edafd-294b-973b-0034-45ee0439e219.htm
---
# Autodesk.Revit.DB.CopyPasteOptions.GetDuplicateTypeNamesHandler Method

Returns current duplicate type names handler or Nothing nullptr a null reference ( Nothing in Visual Basic) if none is set.

## Syntax (C#)
```csharp
public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()
```